DataProcessors/ЛБ_ПомощникЗаполненияПроцентныхСтавокАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПомощникЗаполненияПроцентныхСтавокАкции</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФлВкл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДиапазоныСумм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_УсловияПредоставленияКредита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УсловияПредоставленияКредита</Name>
			<Comment>Условия предоставления займа</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокЗалога</Name>
					<Comment>Срок залога</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Comment>Схема кредитования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ПомощникЗаполненияПроцентныхСтавокАкции/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	// заполним таблицы	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ПО ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.СхемыКредитования.Загрузить(ТаблицаЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛОЖЬ КАК Пометка,
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус,
	               |	ВЫБОР
	               |		КОГДА ЛБ_СтатусыЗалогодателей.ЭтоГруппа
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоГруппа,
	               |	ЛБ_СтатусыЗалогодателей.Родитель КАК Родитель,
	               |	ЛБ_СтатусыЗалогодателей.Наименование КАК СтатусСтрока
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Статус ИЕРАРХИЯ"; 
	ДанныеДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 	    
		
	СтрокаВерхнего = ДанныеДерево.Строки.Добавить();	
    СтрокаВерхнего.СтатусСтрока = "Пустой статус";
	СтрокаВерхнего.ЭтоГруппа = ложь; 
	
	ЗначениеВРеквизитФормы(ДанныеДерево, "ДеревоСтатусов");
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораГруппы(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Результат);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК ДиапазонСумм
	               |ИЗ
	               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	               |ГДЕ
	               |	ЛБ_ДиапазоныСуммЗайма.Родитель = &Родитель
	               |	И ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	ТаблицЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.ДиапазоныСумм.Загрузить(ТаблицЗапроса);
	Для каждого Стр Из Объект.ДиапазоныСумм Цикл
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиапазонПоГруппе(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораГруппы",ЭтаФорма);
	ОткрытьФорму("Справочник.ЛБ_ДиапазоныСуммЗайма.ФормаВыбораГруппы", , ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполнения()
	ВсеОК = Истина;
		
	Если Объект.СтатусыКлиентов.Количество() = 0 Тогда
		Сообщить("Не выбраны статусы клиента!");
		ВсеОК = Ложь;
	КонецЕсли;	

	Если Объект.ДиапазоныСумм.Количество() = 0 Тогда
		Сообщить("Не выбраны диапазоны сумм займа!");
		ВсеОК = Ложь;
	КонецЕсли;	
	
	Возврат ВсеОК;
КонецФункции

&НаСервере
Процедура ПреобразоватьВ_ТЗ(Данные)
	Для Каждого Строка Из Данные.Строки Цикл 
		Если Строка.Пометка Тогда
			НовСтрока = Объект.СтатусыКлиентов.Добавить();
			НовСтрока.Статус = Строка.Статус; 
			
			Если Строка.ЭтоГруппа и Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
				
		Если Строка.Строки.Количество()>0 Тогда
		    ПреобразоватьВ_ТЗ(Строка);
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуСтатусов() 
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоСтатусов");
    Объект.СтатусыКлиентов.Очистить();
    ПреобразоватьВ_ТЗ(ДеревоЗначений); 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)  
	ЗаполнитьТаблицуСтатусов();
	УдСтрокиСК = Новый СписокЗначений;
	Для каждого Стр Из Объект.СхемыКредитования Цикл 
		Если Стр.ФлВкл Тогда
			Продолжить;
		КонецЕсли;
		УдСтрокиСК.Добавить(Стр);
	Конеццикла;	               	
	Для каждого Эл из УдСтрокиСК Цикл 
		Объект.СхемыКредитования.Удалить(Эл.Значение);
	КонецЦикла;                
		
	Если ПроверитьКорректностьЗаполнения() Тогда		
		СтруктураРезультат = Новый Структура;   
		СтруктураРезультат.Вставить("СхемыКредитования", Объект.СхемыКредитования);
		СтруктураРезультат.Вставить("СтатусыКлиентов", Объект.СтатусыКлиентов);
		СтруктураРезультат.Вставить("ДиапазоныСумм", Объект.ДиапазоныСумм);
		Закрыть(СтруктураРезультат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		 Элементы.ДеревоСтатусов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(ЭлементыДерева)
	Для каждого Элемент Из ЭлементыДерева Цикл
		ВлЭлементыДерева = Элемент.ПолучитьЭлементы();
		Если ВлЭлементыДерева.Количество() > 0 Тогда
			СвернутьДерево(ВлЭлементыДерева);
		КонецЕсли;	
		Элементы.ДеревоСтатусов.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	СвернутьДерево(ЭлементыДерева);
КонецПроцедуры  

&НаСервере
Процедура ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Группа, Пометка)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл  
		Если Строка.ЭтоГруппа Тогда
			Если  НЕ (Строка.Статус = Группа) Тогда 
			    Продолжить; 
			КонецЕсли;	
		Иначе       
			Если НЕ ЗначениеЗаполнено(Строка.Родитель) Тогда
				Продолжить;
			ИначеЕсли Строка.Родитель.Статус = Группа Тогда 
			    Строка.Пометка = Пометка;  
			КонецЕсли;	
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочкиПоГруппе(Строка, Группа, Пометка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	


&НаСервере
Процедура ОбработатьОтметкуГруппы(Статус, Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("ДеревоСтатусов");
	ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Статус, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "ДеревоСтатусов");
КонецПроцедуры	


&НаКлиенте
Процедура ДеревоСтатусовПометкаПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоСтатусов.ТекущиеДанные;
	Если ТекСтрока.ЭтоГруппа Тогда
		ОбработатьОтметкуГруппы(ТекСтрока.Статус, ТекСтрока.Пометка);
		ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
	Иначе
		//проверить отметку родителя
		ЭлементыДерева = ДеревоСтатусов.ПолучитьЭлементы();
		Для каждого Элемент Из ЭлементыДерева Цикл
			Если Элемент.ЭтоГруппа Тогда
				Пометка = Истина;
				ВлЭлементы = Элемент.ПолучитьЭлементы();
				Для каждого ВлЭлемент Из ВлЭлементы Цикл
					Если НЕ ВлЭлемент.Пометка Тогда
						Пометка = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Элемент.Пометка = Пометка;
				Прервать;
			КонецЕсли;	
		КонецЦикла;			
    КонецЕсли;
КонецПроцедуры
